# ==================================================
# SCRIPT: Wreck.gd
# Описание: Обломки уничтоженного корабля
# Версия: 0.1
# ==================================================
extends Area2D
# =====================
# ДАННЫЕ ОБЛОМКОВ
# =====================
var items = [] # Предметы, которые остались после уничтожения корабля
var collect_timer = 3.0 # Время до автоматического сбора
# =====================
# ОБНОВЛЕНИЕ ОБЪЕКТА
# =====================
func _process(delta):
	collect_timer -= delta
	if collect_timer <= 0:
		collect()
# =====================
# СОЗДАНИЕ ОБЛОМКОВ
# =====================
func setup(wreck_items):
	items = wreck_items
# =====================
# СБОР ОБЛОМКОВ
# =====================
func collect():
	print("Собраны обломки")
	for item in items:
		GameManager.inventory.append(item)
	print("Новый инвентарь:")
	print(GameManager.inventory)
	queue_free()
	
#Тут конец название скрипта Wreck
